[
  {
    "id": 1,
    "title": "História profissional",
    "imagePath": "assets/images/personal/personalPhoto.png",
    "descriptionContent": "<p> Me chamo Rodrigo Vieira Lima e contarei um pouco da minha trajetória profissional até me tornar o desenvolvedor frontend que atuo até hoje:</p> <p> Desde jovem, sempre fui apaixonado por computação, tendo-a apenas como hobbie nos tempos livres. Até que, em 2017, iniciei minha faculdade de Análise e desenvolvimento de sistemas na FAETERJ-Rio.</p> <p> Em 2019 iniciei profissionalmente na área de tecnologia, onde iniciei meu estágio de Testes e qualidade de software na Nasajon Sistemas, empresa do ramo de sistemas de ERP. Lá eu tive minha primeira experiência profissional, realizando testes manuais em diversos sistemas Web e alguns Desktop, até que entrei no time de automação de testes, que estavam iniciando os primeiros projetos de testes automáticos e pude começar a programar. De primeira, utilizei a linguagem groovy na ferramenta Katalon e depois migrei para o Python na ferramenta TestComplete.</p> <p> Além disso pude entender como funciona o ambiente corporativo e as metodologias ágeis, com reuniões de planejamento, retrospectivas, code review, etc. Também vale destacar meu começo com a ferramenta Git e o Github, experiências que levo até hoje.</p> <p> em 2020 tive a oportunidade de ser efetivado após um ótimo trabalho programando as automações de testes, e fui para o cargo de Assistente de testes e qualidade pleno. Neste cargo, passei a atuar em Home office (que estou até então) e tive os desafios de adaptação ao novo modelo e novas tarefas de maior complexidade da área.</p> <p> Como meu sonho sempre foi de ser um desenvolvedor, passei a estudar tecnologias frontend para tentar uma transição de carreira, até que no final de 2021 consegui a oportunidade de mudar de cargo e ser um Desenvolvedor frontend na Nasajon, atuando no time de Gestão de pessoas.</p> <p> Ingressei na squad de automação de processos, onde desenvolvi projetos de frontend de uma aplicação interna, que fora utilizada para disparar comandos que executam tarefas automáticas de outro sistema de RH/Departamento pessoal. Com o sucesso do projeto, transitei para outra squad, de entrada e saída de funcionários, onde atuei prestando manutenção e criando novas features para o módulo, até que, por fim, fui para a squad de RH, atuando em toda a aplicação.</p> <p> Em 2022 me formei como analista e desenvolvedor de sistemas, onde desenvolvi um aplicativo mobile em Flutter como Trabalho de Conclusão de Curso (TCC) e obtive nota máxima. Com isso, a empresa, que estava transitando do AngularJS para o Flutter, me convidou para um treinamento de Flutter para empresas (da FTeam) e pude ter novos desafios aprendendo técnicas avançadas de desenvolvimento e me especializar ainda mais no frontend, mas, desta vez, no mobile. </p> <p> Pude atuar ainda na manutenção e desenvolvimento do primeiro aplicativo mobile em Flutter da empresa, que era um sistema de auto admissão de funcionário, onde, este, fazia integração com o sistema de RH que eu também atuava. </p> <p> Em 2023 tive a oportunidade de atuar como desenvolvedor frontend freelancer nas horas vagas, onde desenvolvi um sistema em React e NextJS para um laboratório de Química da UFRJ chamado LIPCAT. Neste projeto, tive a oportunidade de aprender novas tecnologias e a lidar com um projeto do zero até a entrega final.</p> <p> Por fim, em 2024, busco uma oportunidade de recolocação no mercado de trabalho na mesma área que estava atuando.</p>"
  },
  {
    "id": 2,
    "title": "Habilidades técnicas",
    "descriptionContent": "<p>Com a minha trajetória profissional pude me especializar nas seguintes habilidades:<p> Angular e AngularJS:: Possuo experiência com o framework, incluindo a criação de componentes reutilizáveis, serviços, diretivas personalizadas e a implementação de rotas e guardas. Também sou proficiente no uso do Angular CLI para gerenciamento de projetos. Desenvolvi este portfólio e demais projetos utilizando versões 16+. Também trabalhei com AngularJS em projetos legados, compreendendo as diferenças e migrações entre as versões. </p><p> Flutter: Tenho experiência em Flutter para desenvolvimento de aplicações móveis, utilizando a mesma base de código para Android e iOS, promovendo a eficiência e a rapidez no desenvolvimento. </p><p> ReactJS e NextJS: Possuo conhecimentos em ReactJS para construir interfaces de usuário dinâmicas e responsivas. Com o NextJS, desenvolvi aplicações server-side rendered (SSR), aproveitando suas funcionalidades para otimização de SEO e performance. </p><p> TypeScript: Utilizo TypeScript para escrever código JavaScript tipado e mais robusto, o que resulta em menos erros e um desenvolvimento mais eficiente. Minha experiência com TypeScript inclui a criação de tipos personalizados e interfaces, bem como a utilização de genéricos e módulos. </p><p> Docker: Tenho experiência em containerização de aplicações usando Docker, o que inclui a criação de Dockerfiles e a configuração de docker-compose para desenvolvimento e deploy consistentes e escaláveis. </p><p> Webpack: Sou proficiente no uso do Webpack para a configuração de builds de projetos, incluindo a otimização de performance e o gerenciamento de assets. Minha experiência com Webpack permite configurar o ambiente de desenvolvimento de forma eficiente. </p><p> APIs RESTful: Tenho experiência na criação e consumo de APIs RESTful, incluindo a integração de APIs de terceiros. </p><p> Testes Unitários: Entendo a importância de garantir a qualidade do código através de testes unitários. Utilizo ferramentas como Jasmine e Karma para escrever e executar testes em aplicações Angular, assegurando que o código funcione conforme esperado e minimizando bugs. Além disso, tenho experiência e treinamento profissional do uso de bibliotecas de testes para Flutter </p><p> Git: Tenho experiência em controle de versão usando Git, incluindo o uso de branches, pull requests e resolução de conflitos. Sou proficiente em trabalhar com plataformas como GitHub e GitLab para colaboração em equipe. </p><p> Engenharia de Software: Tenho um sólido entendimento de princípios de engenharia de software, o que me permite aplicar as melhores práticas no ciclo de vida do desenvolvimento. </p><p> Metodologias Ágeis: Sou adepto das metodologias ágeis para gerenciar projetos de forma eficiente e iterativa. Tenho experiência em participar de sprints, reuniões diárias e retrospectivas para melhorar continuamente o processo de desenvolvimento. </p> <p> Arquitetura Limpa e Clean Code: Aplicando princípios de Clean Architecture e Clean Code, busco escrever código modular e sustentável, facilitando a manutenção e evolução das aplicações. </p><p> Multi Repo e Mono Repo: Tenho experiência na gestão de repositórios de código, utilizando estratégias de Multi Repo e Mono Repo para otimizar o desenvolvimento e a colaboração entre equipes. </p>"
  },
  {
    "id": 3,
    "title": "Habilidades interpessoais",
    "descriptionContent": "<p> Além das minhas competências técnicas em desenvolvimento frontend com Angular e outras tecnologias, acredito que minhas habilidades interpessoais são um diferencial significativo. </p> <p> Comunicação: Sou um comunicador eficaz, capaz de traduzir conceitos técnicos complexos para colegas não técnicos e stakeholders. Isso facilita a colaboração e garante que todos os membros da equipe estejam alinhados com os objetivos do projeto. </p> <p> Resolução de problemas: Tenho uma abordagem analítica e focada na resolução de problemas. Enfrento desafios de forma proativa, buscando soluções criativas e eficazes. Minha capacidade de manter a calma sob pressão me permite resolver problemas rapidamente e de maneira eficiente. </p><p> Adaptabilidade: O mundo da tecnologia está em constante evolução, e estou sempre pronto para aprender e me adaptar a novas ferramentas e metodologias. Meu aprendizado contínuo garante que estou sempre atualizado com as melhores práticas e inovações do setor. </p><p> Gestão de tempo: Sou organizado e eficaz na gestão do meu tempo, o que me permite cumprir prazos rigorosos e gerenciar múltiplas tarefas simultaneamente. Minha capacidade de priorizar tarefas assegura que os projetos sejam entregues no tempo e com alta qualidade. </p><p> Empatia e ética: Tenho um forte senso de empatia, o que me ajuda a entender as necessidades e preocupações dos usuários finais e dos colegas. Além disso, mantenho um padrão ético elevado em todas as minhas atividades profissionais, garantindo integridade e confiança em meu trabalho. </p><p> Feedback construtivo: Acredito no poder do feedback construtivo para o crescimento pessoal e profissional. Estou sempre aberto a receber feedback e também me esforço para fornecer feedback útil e respeitoso aos meus colegas.</p>"
  }
]
