[
  {
    "id": "1",
    "role": "Desenvolvedor Frontend",
    "period": "01/2022 - 05/2024",
    "enterprisePathLogo": "assets/images/enterprises/nasajon.png",
    "enterprise": "Nasajon Sistemas",
    "technologies": {
      "primary": [
        {
          "name": "Angular",
          "path": "assets/images/logos/angularLogo.png"
        },
        {
          "name": "Typescript",
          "path": "assets/images/logos/typescriptLogo.png"
        },
        {
          "name": "Flutter",
          "path": "assets/images/logos/flutterLogo.png"
        }
      ],
      "secondary": [
        {
          "name": "SASS",
          "path": "assets/images/logos/sassLogo.png"
        },
        {
          "name": "Webpack",
          "path": "assets/images/logos/webpackLogo.png"
        },
        {
          "name": "Docker",
          "path": "assets/images/logos/dockerLogo.png"
        },
        {
          "name": "Dart",
          "path": "assets/images/logos/dartLogo.png"
        },
        {
          "name": "Git",
          "path": "assets/images/logos/gitLogo.png"
        },
        {
          "name": "Github",
          "path": "assets/images/logos/githubLogo.png"
        }
      ]
    },
    "description": "<p> Neste cargo atuei como desenvolvedor frontend web e mobile, desenvolvendo e prestando manutenção em aplicações AngularJS com Typescript, Docker e Webpack e um app Mobile utilizando Flutter com Modular, Flutter Triple, Clean architecture, multi repo, etc. Além disso, participei de squads em sprints planejadas de forma mensal, com reuniões diárias, Sprint Planning, retrospectiva e code review, sempre visando atingir metas de OKRs trimestrais, realizando reuniões de Grooming para traçar o melhor planejamento com a equipe. </p> <p> Após muito estudo na área de frontend, me aprimorando com as principais tecnologias do mercado, realizei uma transição de carreira para começar a desenvolver o frontend de uma Dashboard de automação de processos internos da empresa e de seus clientes, onde utilizei as bibliotecas de UI da empresa no meu Projeto AngularJS. O projeto foi um sucesso e, junto com um backend que realizava tais processos, conseguimos manter o sistema em produção e que roda até hoje internamente na empresa. </p> <p> Com a estabilidade do projeto, ingressei em um novo squad para atuar em um projeto referente a um sistema de RH, atuando com os módulos de entrada e saída de colaboradores. Inicialmente prestei manutenção no código existente e, conforme fui me habituando com as regras de negócio e funcionamento da aplicação, desenvolvi novas funcionalidades conforme a necessidade dos clientes e das metas trimestrais. Após evoluir as funcionalidades, passei a codar para todo o sistema de RH, atuando em módulos como controle de férias, solicitações colaboradores, cadastro de vagas, configurações da aplicação e etc. </p> <p> Durante minha jornada no cargo, recebi o desafio de desenvolver um POC para provar eficácia da framework Flutter nas aplicações já existentes, com o objetivo de começar uma troca de tecnologia, pois o AngularJS fora descontinuado. Desenvolvi um projeto contendo 2 módulos do aplicativo de RH, utilizando Flutter com o Modular, Flutter Triple e uma estrutura mono repo. </p> <p> Com o sucesso da POC e da decisão da empresa de iniciar novos projetos com Flutter, recebi o treinamento da FTeam, fornecido pela Nasajon, para ter competência de atuar nos projetos Mobile que estavam nascendo na empresa. Neste treinamento, aprendi recursos e técnicas avançadas da framework Flutter, como a arquitetura Clean Dart, lib Modular (para modularizar a aplicação), o gerenciamento de estados com Flutter Triple, armazenamento interno com Hive, estrutura Mono repo, técnicas de clean code, testes unitários com o Mocktail, etc. </p> <p> Com isso, atuei num aplicativo de auto admissão de colaboradores que possuía uma integração com o sistema web de RH. Nele, aprendi a realizar o deploy para a loja do Google Play, Apple Store e para a Web, aprimorando meu conhecimento no desenvolvimento mobile. </p> <p> Essa experiência me ajudou a me especializar em engenharia de software e a ter adaptabilidade, pois entender estes conceitos, me fizeram um desenvolvedor completo, e que não importa a tecnologia a ser utilizada, com estudos e um bom planejamento, é possível resolver todos os problemas de negócio. </p>"
  },
  {
    "id": "2",
    "role": "Assistente de testes e qualidade",
    "period": "11/2020 - 12/2021",
    "enterprisePathLogo": "assets/images/enterprises/nasajon.png",
    "enterprise": "Nasajon Sistemas",
    "technologies": {
      "primary": [
        {
          "name": "Python",
          "path": "assets/images/logos/pythonLogo.png"
        },
        {
          "name": "TestComplete",
          "path": "assets/images/logos/testcompleteLogo.png"
        },
        {
          "name": "Git",
          "path": "assets/images/logos/gitLogo.png"
        },
        {
          "name": "Github",
          "path": "assets/images/logos/githubLogo.png"
        }
      ],
      "secondary": []
    },
    "description": "<p> Após ser efetivado, tive a responsabilidade de trabalhar na automação dos testes de regressão ainda utilizando Python. Foram inúmeros cases de testes a serem automatizados e, dentro de um planejamento junto à squad de QA, traçamos metas e fizemos um planejamento dentro de sprints para antingir todas as entregas dentro dos prazos estipulados. </p> <p> Aqui também tive a experiência de trabalhar com Git e Github, metodologias ágeis com daily scrum, sprint planning, retrospectiva e code review. </p>"
  },
  {
    "id": "3",
    "role": "Estagiário de testes e qualidade",
    "period": "07/2019 - 10/2020",
    "enterprisePathLogo": "assets/images/enterprises/nasajon.png",
    "enterprise": "Nasajon Sistemas",
    "technologies": {
      "primary": [
        {
          "name": "Python",
          "path": "assets/images/logos/pythonLogo.png"
        },
        {
          "name": "Groovy",
          "path": "assets/images/logos/groovyLogo.png"
        },
        {
          "name": "TestComplete",
          "path": "assets/images/logos/testcompleteLogo.png"
        },
        {
          "name": "Git",
          "path": "assets/images/logos/gitLogo.png"
        },
        {
          "name": "Github",
          "path": "assets/images/logos/githubLogo.png"
        }
      ],
      "secondary": []
    },
    "description": "<p> Aqui iniciei minha jornada na carreira de tecnologia, onde, após 2 anos corridos da faculdade de Análise e desenvolvimento de sistemas, tive a oportunidade de entrar no time de QA da empresa Nasajon, aprendendo os conceitos de teste, engenharia de software e qualidade, testes de regressão, metodologias ágeis e etc. </p> <p> Comecei com a responsabilidade de testar manualmente os sistemas web da empresa, dentre eles sistemas de RH/Departamento pessoal, controle de serviços, gestão de projetos e etc. </p> <p> Junto a isso participei da primeira implementação de automação de testes, onde utilizei a linguagem groovy no software Katalon, para construir os primeiros cases de teste para os aplicativos web. Com isso, tive minha primeira experiência com Git, Github, code review e planning de tarefas referentes aos cases que seriam desenvolvidos. </p> <p> Como a ferramenta Katalon passou a ser paga, foi decidido migrar para uma ferramenta que fazia mais sentido para a empresa, o software TestComplete. Com isso, passei a programar os testes com Python, aprimorando meus conhecimentos na linguagem. </p>"
  }
]
